Tekla Open API Reference for Tekla Structures 2025
IUIEvents.DrawingListSelectionChanged Event
 The DrawingListSelectionChanged event is raised when selection on the drawing list has changed.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.DrawingListSelectionChangedDelegate DrawingListSelectionChanged
Event DrawingListSelectionChanged As Events.DrawingListSelectionChangedDelegate
Value
Type: Tekla.Structures.Drawing.UI.Events.DrawingListSelectionChangedDelegate
Remarks
 This event is also raised if a file is selected or deselected in Document Manager, but no information about the selected file(s) is available.
See Also
Reference
IUIEvents Interface
Tekla.Structures.Drawing.UI Namespace